app/controllers/foods_controller.rb

SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1  [["user_id", 1]]
---
def index
    foods = @current_user.foods.all