app/controllers/recipes_controller.rb

def index
    recipes = @current_user.recipes.all
---
SELECT "recipes".* FROM "recipes"